In [3]:
import pandas as pd
details=[{'year':1990,'name':'alice','department':'hr','age':25,'salary':50000},
         {'year':1990,'name':'bob','department':'rd','age':30,'salary':48000},
         {'year':1990,'name':'charlie','department':'admin','age':45,'salary':55000},
        {'year':1991,'name':'alice','department':'hr','age':26,'salary':52000},
        {'year':1991,'name':'bob','department':'rd','age':31,'salary':50000},
         {'year':1991,'name':'charlie','department':'admin','age':46,'salary':60000},
        {'year':1992,'name':'alice','department':'hr','age':27,'salary':60000},
        {'year':1992,'name':'bob','department':'rd','age':32,'salary':52000},
        {'year':1992,'name':'charlie','department':'admin','age':47,'salary':62000}]
company=pd.DataFrame(details,index=(0,1,2,3,4,5,6,7,8))
company

   age department     name  salary  year
0   25         hr    alice   50000  1990
1   30         rd      bob   48000  1990
2   45      admin  charlie   55000  1990
3   26         hr    alice   52000  1991
4   31         rd      bob   50000  1991
5   46      admin  charlie   60000  1991
6   27         hr    alice   60000  1992
7   32         rd      bob   52000  1992
8   47      admin  charlie   62000  1992

In [5]:
company.groupby(['year'])['salary'].sum()

year
1990    153000
1991    162000
1992    174000
Name: salary, dtype: int64

In [6]:
company.groupby(['name'])['salary'].sum()

name
alice      162000
bob        150000
charlie    177000
Name: salary, dtype: int64

In [7]:
company.groupby(['department'])['salary'].sum()

department
admin    177000
hr       162000
rd       150000
Name: salary, dtype: int64

In [8]:
company.describe()

             age        salary         year
count   9.000000      9.000000     9.000000
mean   34.333333  54333.333333  1991.000000
std     9.055385   5147.815070     0.866025
min    25.000000  48000.000000  1990.000000
25%    27.000000  50000.000000  1990.000000
50%    31.000000  52000.000000  1991.000000
75%    45.000000  60000.000000  1992.000000
max    47.000000  62000.000000  1992.000000

In [11]:
company.groupby(['year']['salary'])

TypeError: list indices must be integers or slices, not str